tutorials/cssInterFoam/test-meniscus/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-6;

vertices
(
    (-50 -1   0)
    ( 50 -1   0)
    ( 50  1   0)
    (-50  1   0)
    (-50 -1  50)
    ( 50 -1  50)
    ( 50  1  50)
    (-50  1  50)
    (-50 -1 -50)
    ( 50 -1 -50)
    ( 50  1 -50)
    (-50  1 -50)
);

blocks
(
    hex (0 1  2  3 4 5 6 7) (100 1 50) simpleGrading (1 1 1)
    hex (8 9 10 11 0 1 2 3) (100 1 50) simpleGrading (1 1 1)
);

boundary
(
    
    bottom
    {
        type patch;
        faces
        (   
            (8 9 10 11)
        );
    }
     
    left
    {
        type patch;
        faces
        (
            (3 0 4 7)
            (11 8 0 3)	  	    
        );
    }
    
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (9 10 2 1)
        );
    }      
      
    top
    {
        type patch;
        faces
        (
       	    (4 5 6 7)
        );
    } 
      
    backFront
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (2 3 7 6) 
            (8 9 1 0)
            (10 11 3 2) 		    
        );
    }   
);

// ************************************************************************* //
