tutorials/cssInterFoam/test-meniscus/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             pcInterFoamOld;

startTime               lastTime;

stopAt                  endTime;

endTime                 5;

deltaT                  1e-6;

writeControl            adjustableRunTime;

writeInterval           1e-3;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        uncompressed;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   0.5;
maxAlphaCo              0.5;

maxDeltaT               1;


// ************************************************************************* //
